#+title: Advanced & Practical Enum usage in Swift
#+tags: swift cocoa ios
#+keywords: feature swift enum algebraic caseclass union case switch pattern simple practical advanced example
#+summary: When and how to use enums in Swift? This is a detailed practical overview of all the possibilities enums can offer you.
#+description: When and how to use enums in Swift? This is a detailed practical overview of all the possibilities enums can offer you.

When and how to use enums in Swift? This is a detailed practical overview of all the possibilities enums can offer you.

Similarly to the [[http://appventure.me/2015/08/20/swift-pattern-matching-in-detail/][=switch= statement]], =enum='s in Swift may at first glance look like a slightly improved variant of the well known *C* =enum= statement. I.e. a type that allows you to define that something is "one of something more general".  However, upon close introspection, the particular design decisions behind Swift's enums allow it to be used in a much wider range of practical scenarios than plain *C* enums. In particular, they're great tools to clearly manifest the intentions of your code.

In this post, we'll first look at the syntax and possibilities of using =enum=, and will then use them in a variety of (hopefully) practical, real world scenarios to give a better idea of how and when to use them. We'll also look a bit at how enums are being used in the Swift Standard library.

Before we dive in, here's a definition of what =enums= can be. We'll revisit this definition later on:

"Enums declare types with finite sets of possible states and accompanying values. With nesting, methods, associated values, and pattern matching, however, enums can define any hierarchically organized data."


** Enum Values

Of course, you may want to have a value assigned to each =enum= case. This is useful if the =enum= itself indeed relates to something which can be expressed in a different type. *C* allows you to assign numbers to =enum cases=. Swift gives you much more flexibility here:

#+BEGIN_SRC swift :noweb-ref enumsimplevalues
// Mapping to Integer
enum Movement: Int {
    case Left = 0
    case Right = 1
    case Top = 2
    case Bottom = 3
}

// You can also map to strings
enum House: String {
    case Baratheon = "Ours is the Fury"
    case Greyjoy = "We Do Not Sow"
    case Martell = "Unbowed, Unbent, Unbroken"
    case Stark = "Winter is Coming"
    case Tully = "Family, Duty, Honor"
    case Tyrell = "Growing Strong"
}

// Or to floating point (also note the fancy unicode in enum cases)
enum Constants: Double {
    case π = 3.14159
    case e = 2.71828
    case φ = 1.61803398874
    case λ = 1.30357
}
#+END_SRC

For =String= and =Int= types, you can even omit the values and the Swift compiler will do the right thing:

#+BEGIN_SRC swift
// Mercury = 1, Venus = 2, ... Neptune = 8
enum Planet: Int {
    case Mercury = 1, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune
}

// North = "North", ... West = "West"
enum CompassPoint: String {
    case North, South, East, West
}
#+END_SRC

#+RESULTS:

Swift supports the following types for the value of an enum:
- Integer
- Floating Point
- String
- Boolean

So you won't be able[fn:: Except by jumping through some hoops, see below] to use, say, a CGPoint as the value of your enum.

If you want to access the values, you can do so with the =rawValue= property:
#+BEGIN_SRC swift :noweb strip-export
<<enumsimplevalues>>
let bestHouse = House.Stark
print(bestHouse.rawValue)
// prints "Winter is coming"
#+END_SRC

#+RESULTS:
: Winter is Coming

However, there may also be a situation where you want to construct an =enum case= from an existing raw value. In that case, there's a special initializer for enums:

#+BEGIN_SRC swift :noweb strip-export
enum Movement: Int {
    case Left = 0
    case Right = 1
    case Top = 2
    case Bottom = 3
}
// creates a movement.Right case, as the raw value for that is 1
let rightMovement = Movement(rawValue: 1)
#+END_SRC

If you use the =rawValue= initializer, keep in mind that it is a [[https://developer.apple.com/library/prerelease/ios/documentation/Swift/Conceptual/Swift_Programming_Language/Declarations.html#//apple_ref/doc/uid/TP40014097-CH34-ID376][failable initializer]], i.e. you get back an [[http://appventure.me/2014/06/13/swift-optionals-made-simple/][Optional]], as the value you're using may not map to any case at all, say if you were to write =Movement(rawValue: 42)=.

#+RESULTS:

This is a very useful feature in case you want to encode low level C binary representations into something much more readable. As an example, have a look as this encoding of the *VNode Flags* for [[https://developer.apple.com/library/mac/documentation/Darwin/Reference/ManPages/man2/kqueue.2.html][the BSD kqeue library]]:

#+BEGIN_SRC swift
enum VNodeFlags : UInt32 {
    case Delete = 0x00000001
    case Write = 0x00000002
    case Extended = 0x00000004
    case Attrib = 0x00000008
    case Link = 0x00000010
    case Rename = 0x00000020
    case Revoke = 0x00000040
    case None = 0x00000080
}
#+END_SRC

This allows you to use the much nicer looking *Delete* or *Write* cases, and later on hand the raw value into the *C* function only when it is really needed.

*** Tuples as Arguments

What's more, the Swift internal associated information  is just a =Tuple=, so you can do things like this:

#+BEGIN_SRC swift :noweb strip-export
<<tradetype>>

let tp = (stock: "TSLA", amount: 100)
let trade = Trade.Sell(tp)

if case let Trade.Sell(stock, amount) = trade {
    print("buy \(amount) of \(stock)")
}
// Prints: "buy 100 of TSLA"
#+END_SRC

#+RESULTS:

This syntax allows you to take =Tuples= as a simple data structure and later on automatically elevate them into a higher type like a =enum case=. Imagine an app where a user can configure a Desktop that he wants to order:

#+BEGIN_SRC swift :noweb-ref tupleargs
typealias Config = (RAM: Int, CPU: String, GPU: String)

// Each of these takes a config and returns an updated config
func selectRAM(_ config: Config) -> Config {return (RAM: 32, CPU: config.CPU, GPU: config.GPU)}
func selectCPU(_ config: Config) -> Config {return (RAM: config.RAM, CPU: "3.2GHZ", GPU: config.GPU)}
func selectGPU(_ config: Config) -> Config {return (RAM: config.RAM, CPU: "3.2GHZ", GPU: "NVidia")}

enum Desktop {
   case Cube(Config)
   case Tower(Config)
   case Rack(Config)
}

let aTower = Desktop.Tower(selectGPU(selectCPU(selectRAM((0, "", "") as Config))))
#+END_SRC

#+RESULTS:
: Tower(32, "3.2GHZ", "NVidia")

Each step of the configuration updates a =tuple= which is handed in to the =enum= at the end. This works even better if we take a hint from *functional programming* apply [fn:: This is a simplified implementation for demo purposes. In reality you'd write this with optionals and a reverse argument order. Have a look at popular functional programming libraries like [[https://github.com/typelift/Swiftz][Swiftz]] or [[https://github.com/ankurp/Dollar.swift][Dollar]]]:

#+BEGIN_SRC swift :noweb strip-export :noweb-ref tuplefunc
<<tupleargs>>

infix operator <^> { associativity left }

func <^>(a: Config, f: (Config) -> Config) -> Config { 
    return f(a)
}
#+END_SRC

#+RESULTS:
: Cube(32, "3.2GHZ", "NVidia")

Finally, we can thread through the different configuration steps. This is particularly helpful if you have many of those steps.

#+BEGIN_SRC swift :noweb strip-export
<<tuplefunc>>

let config = (0, "", "") <^> selectRAM  <^> selectCPU <^> selectGPU
let aCube = Desktop.Cube(config)

#+END_SRC

** Methods and Properties

You can also define methods on an =enum= like so:

#+BEGIN_SRC swift
enum Wearable {
    enum Weight: Int {
        case Light = 1
    }
    enum Armor: Int {
        case Light = 2
    }
    case Helmet(weight: Weight, armor: Armor)
    func attributes() -> (weight: Int, armor: Int) {
       switch self {
         case .Helmet(let w, let a): return (weight: w.rawValue * 2, armor: w.rawValue * 4)
       }
    }
}
let woodenHelmetProps = Wearable.Helmet(weight: .Light, armor: .Light).attributes()
print (woodenHelmetProps)
// prints "(2, 4)"
#+END_SRC

#+RESULTS:
: (2, 4)

Methods on enums exist for every =enum case=. So if you want to have specific code for specific cases, you need a branch or a switch to determine the correct code path.

#+BEGIN_SRC swift
enum Device { 
    case iPad, iPhone, AppleTV, AppleWatch 
    func introduced() -> String {
       switch self {
         case AppleTV: return "\(self) was introduced 2006"
         case iPhone: return "\(self) was introduced 2007"
         case iPad: return "\(self) was introduced 2010"
         case AppleWatch: return "\(self) was introduced 2014"
       }
    }
}
print (Device.iPhone.introduced())
// prints: "iPhone was introduced 2007"
#+END_SRC

*** Static Methods

You can also have static methods on =enums=, i.e. in order to create an =enum= from a non-value type. In this example we want to get the proper Apple Device for the wrong name that's sometimes used by people.

#+BEGIN_SRC swift
enum Device { 
    case AppleWatch 
    static func fromSlang(term: String) -> Device? {
      if term == "iWatch" {
          return .AppleWatch
      }
      return nil
    }
}
print (Device.fromSlang("iWatch"))
#+END_SRC

#+RESULTS:
: Optional(main.Device.AppleWatch)

** Protocols

I already mentioned the similarity between the =structs= and =enums=. In addition to the ability to add methods, Swift also allows you to use *Protocols* and *Protocol Extensions* with enums. 

Swift protocols define an interface or type that other structures can conform to. In this case our =enum= can conform to it. For a start, let's take a protocol from the Swift standard library.

=CustomStringConvertible= is a type with a customized textual representation suitable for printing purposes:

#+BEGIN_SRC swift
protocol CustomStringConvertible {
  var description: String { get }
}
#+END_SRC

It has only one requirement, namely a *getter* for a string. We can implement this on an enum quite easily:

#+BEGIN_SRC swift
enum Trade: CustomStringConvertible {
   case Buy, Sell
   var description: String {
       switch self {
           case Buy: return "We're buying something"
           case Sell: return "We're selling something"
       }
   }
}

let action = Trade.Buy
print("this action is \(action)")
// prints: this action is We're buying something
#+END_SRC

#+RESULTS:
: this action is We're buying something

Some protocol implementations may need internal state handling to cope with the requirements. Imagine a protocol that manages a bank account:

#+BEGIN_SRC swift :noweb-ref accountcompatible
protocol AccountCompatible {
  var remainingFunds: Int { get }
  mutating func addFunds(amount: Int) throws
  mutating func removeFunds(amount: Int) throws
}
#+END_SRC

#+RESULTS:

You could easily fulfill this protocol with a =struct=, but in the context of your application, an =enum= is the more sensible approach. However, you can't add properties like =var remainingFunds: Int= to an =enum=, so would you model that? The answer is actually easy, you can use associated values for this:

#+NAME: feature-image
#+BEGIN_SRC swift :noweb strip-export :noweb-ref accountthing :export-image true :export-template template4
enum Account {
  case Empty
  case Funds(remaining: Int)

  enum Error: ErrorType {
    case Overdraft(amount: Int)
  }

  var remainingFunds: Int {
    switch self {
    case Empty: return 0
    case Funds(let remaining): return remaining
    }
  }
}
#+END_SRC

To keep things clean, we can then define the required protocol functions in a protocol extension on the =enum=:

#+BEGIN_SRC swift :noweb strip-export  
<<accountcompatible>>
<<accountthing>>
extension Account: AccountCompatible {

  mutating func addFunds(amount: Int) throws {
    var newAmount = amount
    if case let .Funds(remaining) = self {
      newAmount += remaining
    }
    if newAmount < 0 {
      throw Error.Overdraft(amount: -newAmount)
    } else if newAmount == 0 {
      self = .Empty
    } else {
      self = .Funds(remaining: newAmount)
    }
  }

  mutating func removeFunds(amount: Int) throws {
    try self.addFunds(amount * -1)
  }

}

var account = Account.Funds(remaining: 20)
print("add: ", try? account.addFunds(10))
print ("remove 1: ", try? account.removeFunds(15))
print ("remove 2: ", try? account.removeFunds(55))
// prints:
// : add:  Optional(())
// : remove 1:  Optional(())
// : remove 2:  nil
#+END_SRC

#+RESULTS: feature-image
: add:  Optional(())
: remove 1:  Optional(())
: remove 2:  nil

As you can see, we implemented all the protocol requirements by storing our values within our =enum cases=. A very nifty side effect of this is, that now you can test for an empty account with a simple pattern match all over your code base. You don't have to see whether the remainingFunds are zero.

We're also nesting a =ErrorType= compatible =enum= in the *Account* enum so that we can use Swift 2.0's new error handling. This is explained in more detail in the [[#errortype][*Practical Use Cases*]] section.


** Generic Enums

Enums can also be defined over generic parameters. You'd use them to adapt the associated values of an enum. The simplest example comes straight from the Swift standard library, namely the =Optional= type. You probably mostly use it with *optional chaining* (=?=), =if let=, =guard let=, or =switch=, but syntactically you can also use Optionals like so:

#+BEGIN_SRC swift
let aValue = Optional<Int>.Some(5)
let noValue = Optional<Int>.None
if noValue == Optional.None { print("No value") }
#+END_SRC

#+RESULTS:
: No value

This is the direct usage of an Optional without any of the syntactic sugar that Swift adds in order to make your life a tremendous amount easier. If you look at the code above, you can probably guess that internally the =Optional= is defined as follows [fn:: This is a simplified version, of course. Swift adds a lot of sugar for you]:

#+BEGIN_SRC swift
// Simplified implementation of Swift's Optional
enum MyOptional<T> {
  case Some(T)
  case None
}
#+END_SRC

What's special here is, that the enum's *associated values* take the type of the generic parameter =T=, so that optionals can be built for any kind you wish to return.

Enums can have multiple generic parameters. Take the well-known *Either* type which is not part of Swift's standard library but implemented in many open source libraries as well as prevalent in other functional programming languages like Haskell or F#. The idea is that instead of just returning a value or no value (née Optional) you'd return either the successful value or something else (probably an error value).

#+BEGIN_SRC swift
// The well-known either type is, of course, an enum that allows you to return either
// value one (say, a successful value) or value two (say an error) from a function
enum Either<T1, T2> {
  case Left(T1)
  case Right(T2)
}
#+END_SRC

Finally, all the type constraints that work on classes and structs in Swift also work on enums.

#+BEGIN_SRC swift
// Totally nonsensical example. A bag that is either full (has an array with contents)
// or empty.
enum Bag<T: SequenceType where T.Generator.Element==Equatable> {
  case Empty
  case Full(contents: T)
}
#+END_SRC

#+RESULTS:

** Using Custom Data Types as Enum Values

If we neglect associated values, then the value of an enum can only be an Integer, Floating Point, String, or Boolean. If you need to support something else, you can do so by implementing the =StringLiteralConvertible= protocol which allows the type in question to be serialized to and from String.

As an example, imagine you'd like to store the different screen sizes of iOS devices in an enum:

#+BEGIN_SRC swift
enum Devices: CGSize {
   case iPhone3GS = CGSize(width: 320, height: 480)
   case iPhone5 = CGSize(width: 320, height: 568)
   case iPhone6 = CGSize(width: 375, height: 667)
   case iPhone6Plus = CGSize(width: 414, height: 736)
}
#+END_SRC

However, this doesn't compile. CGSize is not a literal and can't be used as an enum value. Instead, what you need to do is add a type extension for the =StringLiteralConvertible= protocol. The protocol requires us to implement three *initializers* each of them is being called with a =String=, and we have to convert this string into our receiver type (=CGSize=)

#+BEGIN_SRC swift :prologue "import Foundation; func CGSizeFromString(a: String) -> CGSize { return NSSizeFromString(a)}" :noweb-ref cgsizenum
extension CGSize: StringLiteralConvertible {
    public init(stringLiteral value: String) {
        let size = CGSizeFromString(value)
        self.init(width: size.width, height: size.height)
    }
    
    public init(extendedGraphemeClusterLiteral value: String) {
        let size = CGSizeFromString(value)
        self.init(width: size.width, height: size.height)
    }
    
    public init(unicodeScalarLiteral value: String) {
        let size = CGSizeFromString(value)
        self.init(width: size.width, height: size.height)
    }
}
#+END_SRC

#+RESULTS:

Now, we can write our =enum=, with one downside though: The initial values have to be written as a String, since that's what the enum will use (remember, we complied with StringLiteralConvertible, so that the *String* can be converted to our =CGSize= type.

#+BEGIN_SRC swift :noweb-ref cgsizeenum2 :prologue "import Foundation" 
enum Devices: CGSize {
   case iPhone3GS = "{320, 480}"
   case iPhone5 = "{320, 568}"
   case iPhone6 = "{375, 667}"
   case iPhone6Plus = "{414, 736}"
}
#+END_SRC

This, finally, allows us to use our =CGSize= enum. Keep in mind that in order to get the actual CGSize value, we have to access the =rawvalue= of the enum.

#+BEGIN_SRC swift :noweb strip-export :prologue "import Foundation; func CGSizeFromString(a: String) -> CGSize { return NSSizeFromString(a)}"  
<<cgsizenum>>
<<cgsizeenum2>>
let a = Devices.iPhone5
let b = a.rawValue
print("the phone size string is \(a), width is \(b.width), height is \(b.height)")
// prints : the phone size string is iPhone5, width is 320.0, height is 568.0
#+END_SRC

#+RESULTS:
: the phone size string is iPhone5, width is 320.0, height is 568.0

The String serialization requirement makes it a bit difficult to use any kind of type, but for some specific use cases, this can work well (such as *NSColor* / *UIColor*). However, you can also use this with your custom types obviously.

** Units

Units and unit conversion are another nice use case for enums. You can map the units and their respective values and then add methods to do automatic conversions. Here's an oversimplified example.

#+BEGIN_SRC swift
enum Liquid: Float {
  case ml = 1.0
  case l = 1000.0
  func convert(amount amount: Float, to: Liquid) -> Float {
      if self.rawValue < to.rawValue {
         return (self.rawValue / to.rawValue) * amount
      } else {
         return (self.rawValue * to.rawValue) * amount
      }
  }
}
// Convert liters to milliliters
print (Liquid.l.convert(amount: 5, to: Liquid.ml))
#+END_SRC

#+RESULTS:
: 5000.0

Another example of this would be Currency conversion. Also, mathematical symbols (such as degrees vs radians) can benefit from this.

